app/views/public/posts/edit.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "tag_maps" ON "tags"."id" = "tag_maps"."tag_id" WHERE "tag_maps"."post_id" = ?  [["post_id", 28]]
---
          <% @tag_name = "" %>
          <% @post.tags.each do |tag| %>

SELECT "post_images".* FROM "post_images" WHERE "post_images"."post_id" = ?  [["post_id", 1]]
---
      <h4>投稿済画像</h4>
      <% @post.post_images.each do |image| %>