app/views/public/posts/index.html.erb

            <% @tag.each do |tag| %>
              <div class="badge p-2 m-2"><%= link_to "# #{tag.tag_name}(#{tag.posts.count})", tag_posts_path(tag_id: tag.id) %></div>
---
SELECT "tags".* FROM "tags"
SELECT COUNT(*) FROM "posts" INNER JOIN "tag_maps" ON "posts"."id" = "tag_maps"."post_id" WHERE "tag_maps"."tag_id" = ?  [["tag_id", 3]]
SELECT "posts".* FROM "posts"

              <!--<img class="card-img-top" src="..." alt="Card image cap">-->
              <!--<#%= attachment_image_tag User.find(post.user_id), :profile_image, :fill, 30, 30, format: "jpg", fallback: "no_image-.jpg" %>-->
---
SELECT "post_images".* FROM "post_images" WHERE "post_images"."post_id" = ?  [["post_id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

                </div>
                <i class="far fa-comments"><%= link_to post.comments.count %></i>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]