app/views/public/posts/search.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "tag_maps" ON "posts"."id" = "tag_maps"."post_id" WHERE "tag_maps"."tag_id" = ?  [["tag_id", 1]]
SELECT COUNT(*) FROM "posts" INNER JOIN "tag_maps" ON "posts"."id" = "tag_maps"."post_id" WHERE "tag_maps"."tag_id" = ?  [["tag_id", 1]]
---
<!--  <%= link_to tag.tag_name, tag_posts_path(tag_id: tag.id) %>-->
<!--  <%= tag.posts.count %>-->