app/views/public/posts/show.html.erb

            <div class="img-size">
              <% @post.post_images.each do |image| %>
---
SELECT "post_images".* FROM "post_images" WHERE "post_images"."post_id" = ?  [["post_id", 9]]

      <!---タグ--->
      <% @post.tags.each do |tag| %>
        <div class="tag p-2 m-2">
          <%= link_to "# #{tag.tag_name}(#{tag.posts.count})", tag_posts_path(tag_id: tag.id), class: "link-text" %>
---
SELECT "tags".* FROM "tags" INNER JOIN "tag_maps" ON "tags"."id" = "tag_maps"."tag_id" WHERE "tag_maps"."post_id" = ?  [["post_id", 27]]

        <!--評価を平均点て表示-->
        <div class="review-rating" id="star-read" data-score="<%= @post.rates.average(:rate) %>"></div>
---
SELECT AVG("rates"."rate") FROM "rates" WHERE "rates"."post_id" = ?  [["post_id", 9]]