app/views/public/posts/show.html.erb

SELECT AVG("rates"."rate") FROM "rates" WHERE "rates"."post_id" = ?  [["post_id", 9]]
---
<!--評価を平均点て表示-->
<div class="review-rating" id="star-read" data-score="<%= @post.rates.average(:rate) %>">評価</div>