app/controllers/admin/users_controller.rb

  def show
    @user = User.find(params[:id])
    @posts = Post.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"

  def update
    user = User.find(params[:id])
    if user.update(admin_user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "is_deleted" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_deleted", 0], ["updated_at", "2021-11-12 06:30:39.933165"], ["id", 4]]