app/views/public/comments/_comment_index.html.erb

      <br>
      コメント日：<%= comment.created_at.strftime('%Y/%m/%d') %>
---
INSERT INTO "comments" ("user_id", "post_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["post_id", 18], ["comment", "e"], ["created_at", "2021-11-11 07:12:44.803940"], ["updated_at", "2021-11-11 07:12:44.803940"]]