app/controllers/public/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC  [["post_id", 18]]
INSERT INTO "comments" ("user_id", "post_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["post_id", 18], ["comment", "h"], ["created_at", "2021-11-11 07:19:32.944549"], ["updated_at", "2021-11-11 07:19:32.944549"]]
---
  def create
    post = Post.find(params[:post_id])
    @comments = post.comments.order(created_at: :desc)
    comment = current_user.comments.new(comment_params)
    comment.post_id = post.id
    if comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC  [["post_id", 18]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 23]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
---
  def destroy
    post = Post.find(params[:post_id])
    @comments = post.comments.order(created_at: :desc)
    Comment.find_by(id: params[:id]).destroy