app/controllers/public/maps_controller.rb

SELECT "posts"."latitude", "posts"."longitude" FROM "posts"
---
  def index
    gon.build_positions = Post.all.pluck(:latitude, :longitude)