app/controllers/public/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    tag_list = params[:post][:tag_name].split(nil)
    if @post.save
      @post.save_tag(tag_list)
---
INSERT INTO "posts" ("user_id", "title", "introduction", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["title", "map_test"], ["introduction", "map"], ["address", "東京都渋谷区道玄坂2丁目29-1"], ["created_at", "2021-11-09 06:24:18.632894"], ["updated_at", "2021-11-09 06:24:18.632894"]]
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag_name", "test"], ["created_at", "2021-11-14 04:25:39.168928"], ["updated_at", "2021-11-14 04:25:39.168928"]]

  def index
    @posts = Post.all
    @tag = Tag.all
---
SELECT "posts".* FROM "posts"
SELECT "tags".* FROM "tags"

  def show
    @post = Post.find(params[:id])
    @user = @post.user
    @comment = Comment.new
    # 新しい順取得
    @comments = @post.comments.order(created_at: :desc)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC  [["post_id", 14]]

  def search
    @tags = Tag.all
    @tag = Tag.find(params[:tag_id])
    @posts = @tag.posts.all
---
SELECT "tags".* FROM "tags"
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" INNER JOIN "tag_maps" ON "posts"."id" = "tag_maps"."post_id" WHERE "tag_maps"."tag_id" = ?  [["tag_id", 1]]