app/controllers/public/posts_controller.rb

  def destroy
    post = Post.find(params[:id])
    post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]