app/controllers/public/rates_controller.rb

INSERT INTO "rates" ("post_id", "user_id", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 17], ["user_id", 3], ["rate", 2.5], ["created_at", "2021-11-10 09:15:42.741332"], ["updated_at", "2021-11-10 09:15:42.741332"]]
---
  def create
    rate = current_user.rates.new(rate_params)
    rate.post_id = params[:post_id]
    if rate.save