app/controllers/public/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def follow
    @followings = User.find(params[:user_id]).followings.where.not(id: current_user.id)
    @followers =  User.find(params[:user_id]).followers.where.not(id: current_user.id)