app/controllers/public/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test3@test3"], ["LIMIT", 1]]
---
  def reject_user
    @user = User.find_by(email: params[:user][:email].downcase)