app/controllers/public/user_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "test2"], ["profile_image_id", "ab91fc2eb288234079c28e7dd7375afd89de4ac707d2fbc39b379ada515d"], ["updated_at", "2021-11-07 07:24:28.436148"], ["id", 2]]

  def withdraw
    @user = current_user
    @user.update(is_deleted: true)
---
UPDATE "users" SET "is_deleted" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_deleted", 1], ["updated_at", "2021-11-05 05:51:42.425257"], ["id", 1]]