app/views/public/favorites/_favorite.html.erb

    <%= link_to  post_favorites_path(post), method: :delete, remote: true do %>
      <i class="fas fa-heart"></i><%= post.favorites.count%>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 18]]

    <%= link_to  post_favorites_path(post), method: :post, remote: true do %>
      <i class="far fa-heart"></i><%= post.favorites.count%>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 18]]