app/views/admin/posts/index.html.erb

SELECT "posts".* FROM "posts"
SELECT "post_images".* FROM "post_images" WHERE "post_images"."post_id" = ?  [["post_id", 13]]
---
      <td>
        <% post.post_images.each do |image| %>