app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "title", "introduction", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["title", "kkk"], ["introduction", ""], ["address", ""], ["created_at", "2021-11-05 14:40:45.478784"], ["updated_at", "2021-11-05 14:40:45.478784"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save