app/models/post.rb

  def save_tag(sent_tags)
    current_tags = self.tags.pluck(:tag_name) unless self.tags.nil?
    old_tags = current_tags - sent_tags
    new_tags = sent_tags - current_tags

    # 古いタグを削除
    old_tags.each do |old|
      self.tags.delete Tag.find_by(tag_name: old)
    end

    # 新しいタグをデータベースに保存
    new_tags.each do |new|
      new_post_tag = Tag.find_or_create_by(tag_name: new)
---
SELECT "tags"."tag_name" FROM "tags" INNER JOIN "tag_maps" ON "tags"."id" = "tag_maps"."tag_id" WHERE "tag_maps"."post_id" = ?  [["post_id", 28]]
SELECT  "tags".* FROM "tags" WHERE "tags"."tag_name" = ? LIMIT ?  [["tag_name", "tiba"], ["LIMIT", 1]]
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag_name", "tiba"], ["created_at", "2021-11-14 08:07:28.259426"], ["updated_at", "2021-11-14 08:07:28.259426"]]