app/models/user.rb

INSERT INTO "relationships" ("following_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["following_id", 2], ["followed_id", 1], ["created_at", "2021-11-07 06:30:23.243389"], ["updated_at", "2021-11-07 06:30:23.243389"]]
---
  def follow(user_id, following_id)
    Relationship.create!(followed_id: user_id, following_id: following_id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 7]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ? AND "relationships"."following_id" = ? LIMIT ?  [["followed_id", 1], ["following_id", 2], ["LIMIT", 1]]
---
  def unfollow(user_id, following_id)
    Relationship.find_by(followed: user_id, following_id: following_id).destroy!

SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."followed_id" WHERE "relationships"."following_id" = ? AND "users"."id" = ? LIMIT ?  [["following_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def following?(user)
    followings.include?(user)