app/views/admin/users/show.html.erb

SELECT "posts".* FROM "posts"
SELECT "post_images".* FROM "post_images" WHERE "post_images"."post_id" = ?  [["post_id", 13]]
---
            <td>
              <% post.post_images.each do |image| %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 13]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 13]]
---
            <td id="favorite_buttons_<%= post.id %>">
             <i class="far fa-heart"></i><%= post.favorites.count %>
            </td>
            <td>コメント数<%= post.comments.count %></td>